Repository: lorensala/meddly
Catalog: lib/l10n/arb/app_*.arb
Languages: es

source: Notifications
es: Notificaciones

# emailHint
source: Email
es: Correo electrónico

# passwordHint
source: Password
es: Contraseña

source: Accept
es: Aceptar

source: Skip
es: Saltar

source: Next
es: Siguiente

source: Save
es: Guardar

source: Try again
es: Inténtalo de nuevo

source: Share
es: Compartir

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

source: Delete
es: Eliminar

source: Apply
es: Aplicar

source: Clean selection
es: Limpiar selección

# confirmDiscardChangesTitle
source: Discard changes?
es: ¿Descartar cambios?

# confirmDiscardChangesDescription
source: All changes will be lost
es: Se perderán los cambios que no hayas guardado.

source: Discard changes
es: Descartar

# calendarNotFoundError
source: Calendar not found
es: Calendario no encontrado

# alreadyConsumedError
source: This medicine has already been consumed
es: Este medicamento ya ha sido consumido

# consumptionDoesNotExistError
source: Consumption does not exist
es: El consumo no existe

source: Cancelled by user
es: Cancelado por el usuario

# accountsExistsWithDifferentCredentials
source: An account already exists with the same email address but different sign-in credentials. Sign in using a provider associated with this email address.
es: Ya existe una cuenta con la misma dirección de correo electrónico pero con credenciales de inicio de sesión diferentes. Inicia sesión utilizando un proveedor asociado a esta dirección de correo electrónico.

source: Server error
es: Error del servidor

# emailAlreadyInUse
source: The email address is already in use by another account.
es: La dirección de correo electrónico ya está en uso por otra cuenta.

source: Weak password
es: Contraseña débil

source: Expired action code
es: Código de acción expirado

source: Requires recent login
es: Requiere inicio de sesión reciente

# tooManyRequests
source: We have blocked all requests from this device due to unusual activity. Try again later.
es: Hemos bloqueado todas las solicitudes desde este dispositivo debido a una actividad inusual. Inténtalo de nuevo más tarde.

# logInWithGoogleError
source: Error logging in with Google
es: Error al iniciar sesión con Google

# wrongPassword
source: The password is invalid or the user does not have a password.
es: La contraseña no es válida o el usuario no tiene una contraseña.

# userNotFound
source: There is no user record corresponding to this identifier. The user may have been deleted.
es: No hay ningún registro de usuario correspondiente a este identificador. Es posible que el usuario haya sido eliminado.

# userDisabled
source: The user account has been disabled by an administrator.
es: La cuenta de usuario ha sido desactivada por un administrador.

# operationNotAllowed
source: Password sign-in is disabled for this project.
es: El inicio de sesión con contraseña está deshabilitado para este proyecto.

# unknownError
source: An unknown error has occurred.
es: Se ha producido un error desconocido.

# credentialAlreadyInUse
source: This credential is already associated with a different user account.
es: Esta credencial ya está asociada a una cuenta de usuario diferente.

# emailEmpty
source: Email cannot be empty
es: El correo electrónico no puede estar vacío

# passwordTooLong
source: Password must be at most 20 characters
es: La contraseña debe tener como máximo 20 caracteres

# passwordTooShort
source: Password must be at least 8 characters
es: La contraseña debe tener al menos 8 caracteres

# passwordEmpty
source: Password cannot be empty
es: La contraseña no puede estar vacía

source: Don't have an account?
es: ¿No tienes una cuenta?

source: Already have an account?
es: ¿Ya tienes una cuenta?

source: Password reset email sent
es: Se ha enviado un correo electrónico para restablecer la contraseña

# confirmPasswordHint
source: Confirm password
es: Confirmar contraseña

source: Passwords don't match
es: Las contraseñas no coinciden

source: Send password reset email
es: Enviar correo electrónico para restablecer la contraseña

source: Login with email address
es: Iniciar sesión con email

source: Login with Google
es: Iniciar sesión con Google

source: Error creating account
es: Error al crear la cuenta

source: Invalid action code
es: Código de acción no válido

source: Invalid verification code.
es: Código de verificación no válido.

source: Invalid verification ID.
es: ID de verificación no válido.

# invalidEmail
source: The email address is badly formatted.
es: La dirección de correo electrónico está mal formateada.

source: Invalid email and password combination.
es: Combinación de correo electrónico y contraseña no válida.

# invalidPassword
source: Password must be at least 8 characters, contain at least one number, one uppercase letter and one special character
es: La contraseña debe tener al menos 8 caracteres, contener al menos un número, una letra mayúscula y un carácter especial

# invalidName
source: Name is invalid
es: El nombre no es válido

# invalidLastName
source: Last name is invalid
es: El apellido no es válido

# invalidBirthdate
source: Birthdate is invalid
es: La fecha de nacimiento no es válida

# invalidHeight
source: Height is invalid
es: La altura no es válida

# invalidWeight
source: Weight is invalid
es: El peso no es válido

# invalidPhoneNumber
source: Phone number is invalid
es: El número de teléfono no es válido

# invalidMedicineName
source: Medicine name is invalid
es: El nombre del medicamento no es válido

# invalidDosis
source: Dosis is invalid
es: La dosis no es válida

# invalidStockWarning
source: Stock warning is invalid
es: La advertencia de stock no es válida

# invalidCurrentStock
source: Current stock is invalid
es: El stock actual no es válido

# invalidInstructions
source: Instructions are invalid
es: Las instrucciones no son válidas

source: Invalid measurement value
es: Valor de medición no válido

# birthdateUnderage
source: You must be at least 18 years old to use this app
es: Debes tener al menos 18 años para usar esta aplicación

# nameTooLong
source: Name must be at most 50 characters
es: El nombre debe tener como máximo 50 caracteres

# lastNameEmpty
source: Last name cannot be empty
es: El apellido no puede estar vacío

# lastNameTooLong
source: Last name must be at most 50 characters
es: El apellido debe tener como máximo 50 caracteres

# birthdateEmpty
source: Birthdate cannot be empty
es: La fecha de nacimiento no puede estar vacía

# heightEmpty
source: Height cannot be empty
es: La altura no puede estar vacía

# heightNegative
source: Height cannot be negative
es: La altura no puede ser negativa

# heightZero
source: Height cannot be zero
es: La altura no puede ser cero

# weightEmpty
source: Weight cannot be empty
es: El peso no puede estar vacío

# weightNegative
source: Weight cannot be negative
es: El peso no puede ser negativo

# weightZero
source: Weight cannot be zero
es: El peso no puede ser cero

# phoneNumberEmpty
source: Phone number cannot be empty
es: El número de teléfono no puede estar vacío

# phoneNumberTooLong
source: Phone number must be at most 20 characters
es: El número de teléfono debe tener como máximo 20 caracteres

# phoneNumberTooShort
source: Phone number must be at least 8 characters
es: El número de teléfono debe tener al menos 8 caracteres

# phoneNumberNotNumeric
source: Phone number must be numeric
es: El número de teléfono debe ser numérico

source: Notification preference not found
es: Preferencia de notificación no encontrada

# notificationPreferenceAlreadyExistsError
source: Notification preference already exists
es: La preferencia de notificación ya existe

# notificationPreferenceDoesNotExistError
source: Notification preference does not exist
es: La preferencia de notificación no existe

# medicineNameEmpty
source: Medicine name cannot be empty
es: El nombre del medicamento no puede estar vacío

# medicineNameTooLong
source: Medicine name must be at most 100 characters
es: El nombre del medicamento debe tener como máximo 100 caracteres

# instructionsTooLong
source: Instructions must be at most 100 characters
es: Las instrucciones deben tener como máximo 100 caracteres

source: Medicine not found
es: Medicamento no encontrado

source: Measurement not found
es: Medición no encontrada

source: Connection error
es: Error de conexión

source: Already your supervisor
es: Ya estas supervisado por este usuario

source: Invalid invitation code
es: Código de invitación no válido

source: Supervisor not found
es: Supervisor no encontrado

source: Supervised not found
es: Supervisado no encontrado

# cantSuperviseYourself
source: You can't supervise yourself
es: No puedes supervisarte a ti mismo

source: New appointment
es: Nuevo turno médico

source: Edit appointment
es: Editar turno médico

source: Cardiology
es: Cardiología

source: Dermatology
es: Dermatología

source: Endocrinology
es: Endocrinología

source: Gastroenterology
es: Gastroenterología

source: Gynecology
es: Ginecología

source: Hematology
es: Hematología

source: Infectious Disease
es: Enfermedades Infecciosas

source: Neurology
es: Neurología

source: Oncology
es: Oncología

source: Ophthalmology
es: Oftalmología

source: Orthopedics
es: Ortopedia

source: Otorhinolaryngology
es: Otorrinolaringología

source: Pediatrics
es: Pediatría

source: Psychiatry
es: Psiquiatría

source: Radiology
es: Radiología

source: Rheumatology
es: Reumatología

source: Urology
es: Urología

source: Pulmonology
es: Pulmonología

source: Nephrology
es: Nefrología

source: Otolaryngology
es: Otorrinolaringología

source: Surgery
es: Cirugía

source: Other
es: Otro

# deleteAppointmentConfirmation
source: Are you sure you want to delete this appointment?
es: ¿Estás seguro que deseas eliminar este turno médico?

# guidanceConsultationTitle
source: Get your guidance consultation
es: Obtén consultas orientativas

# registerMeasurementsTitle
source: Register your measurements
es: Registra tus mediciones

# followYourTreatmentsTitle
source: Follow your treatments
es: Seguir tus tratamientos

# guidanceConsultationDescription
source: Artificial intelligence analyzes your symptoms or images to provide possible diseases.
es: La inteligencia artificial analiza tus síntomas o imágenes para ofrecerte posibles enfermedades.

# registerMeasurementsDescription
source: You can register important data for health monitoring, such as insulin and blood oxygen level.
es: Es posible registrar datos importantes para el seguimiento de la salud, como el nivel de insulina y oxígeno en sangre.

# followYourTreatmentsDescription
source: Receive notifications and reminders to take medications and follow the treatment plan effectively.
es: Recibe notificaciones y recordatorios para tomar medicamentos y seguir el plan de tratamiento de manera eficaz.

source: Login
es: Iniciar sesión

source: Forgot password?
es: ¿Olvidaste tu contraseña?

source: Sign up
es: Registrarse

source: terms and conditions
es: términos y condiciones

source: Start now
es: Comenzar ahora

# nameHint
source: Name
es: Nombre

# nameEmpty
source: Name cannot be empty
es: El nombre no puede estar vacío

# lastNameHint
source: Last name
es: Apellido

# birthdateHint
source: Birthdate
es: Fecha de nacimiento

# heightHint
source: Height
es: Altura

# weightHint
source: Weight
es: Peso

# phoneNumberHint
source: Phone number
es: Número de teléfono

# sexHint
source: Sex
es: Sexo

# sexDescription
source: Select your sex at birth
es: Selecciona tu sexo asignado al nacer

# sexWhy
source: Why do we ask for this?
es: ¿Por qué solicitamos esta información?

source: Male
es: Hombre

source: Female
es: Mujer

source: Create account
es: Crear cuenta

source: Setup
es: Configuración

# setupNameTitle
source: What's your name?
es: ¿Cuál es tu nombre?

# setupNameSubtitle
source: We will use this name to greet you
es: Usaremos este nombre para saludarte

# setupBirthdateTitle
source: When were you born?
es: ¿Cuándo naciste?

# setupBirthdateSubtitle
source: We will use this information for your medical records
es: Usaremos esta información para tus registros médicos

# setupHeightWeightTitle
source: What is your height and weight?
es: ¿Cuál es tu altura y peso?

# setupHeightWeightSubtitle
source: We will use this information for your medical records
es: Usaremos esta información para tus registros médicos

# setupSexTitle
source: What is your sex?
es: ¿Cuál es tu sexo?

# setupSexSubtitle
source: We will use this information for your medical records
es: Usaremos esta información para tus registros médicos

# sexWhyDescription
source: In our medical app, we only offer the option to select between "Male" and "Female" in the sex selection due to medical and practical reasons. From a medical perspective, the binary classification of sex has historically been used in medicine because most diseases and conditions have a higher prevalence in one gender than the other. In addition, biological differences between males and females can influence how diseases are presented and treated. For example, women have a higher risk of developing osteoporosis while men have a higher risk of coronary disease. Symptoms and the presentation of some diseases can also vary by gender. Therefore, having accurate information about a patient's sex can help doctors make a more accurate diagnosis and provide appropriate treatment. Regarding practical reasons, limiting the options to "Male" and "Female" facilitates data collection and analysis. By having a binary classification, we can obtain more precise and useful information about the health of our users. It's important to note that we understand that gender is a more complex and varied issue that can encompass a wider range of identities. However, in our medical app, we limit ourselves to offering these two options due to medical and practical reasons. We appreciate your understanding and are committed to providing high-quality and respectful medical care to all individuals who use our app.
es: En nuestra aplicación médica, solo ofrecemos la opción de seleccionar entre "Hombre" y "Mujer" en la selección de sexo debido a razones médicas y prácticas. Desde una perspectiva médica, la clasificación binaria del sexo se ha utilizado históricamente en medicina debido a que la mayoría de las enfermedades y afecciones tienen una mayor prevalencia en un género que en el otro. Además, las diferencias biológicas entre hombres y mujeres pueden influir en cómo se presentan y tratan las enfermedades. Por ejemplo, las mujeres tienen un mayor riesgo de desarrollar osteoporosis mientras que los hombres tienen un mayor riesgo de enfermedad coronaria. Los síntomas y la presentación de algunas enfermedades también pueden variar según el género. Por lo tanto, contar con información precisa sobre el sexo de un paciente puede ayudar a los médicos a realizar un diagnóstico más preciso y brindar un tratamiento adecuado. En cuanto a razones prácticas, limitar las opciones a "Hombre" y "Mujer" facilita la recopilación y el análisis de datos. Al tener una clasificación binaria, podemos obtener información más precisa y útil sobre la salud de nuestros usuarios. Es importante tener en cuenta que entendemos que el género es un tema más complejo y variado que puede abarcar una gama más amplia de identidades. Sin embargo, en nuestra aplicación médica nos limitamos a ofrecer estas dos opciones debido a razones médicas y prácticas. Agradecemos tu comprensión y estamos comprometidos a brindar una atención médica de alta calidad y respetuosa a todas las personas que utilizan nuestra aplicación.

source: Timeout
es: Tiempo de espera

source: Send OTP
es: Enviar OTP

# enterPhoneNumber
source: Enter your phone number
es: Ingresa tu número de teléfono

# enterPhoneNumberDescription
source: You'll receive a 6 digit code to verify next
es: Recibirás un código de 6 dígitos para verificar

# enterCode
source: Enter the code we sent to
es: Ingresa el código que enviamos a

# enterCodeDescription
source: Didn't receive the code? Tap on "Resend code"
es: ¿No recibiste el código? Toca en "Reenviar código"

source: Resend code
es: Reenviar código

# codeWillBeResent
source: Code will be resent in
es: El código se enviará de nuevo en

source: New measurement
es: Nueva medición

source: New medicine
es: Nuevo medicamento

source: Common presentations
es: Presentaciones comunes

source: Other presentations
es: Otras presentaciones

# medicineFrecuencySpecificDays
source: Specific days
es: Días específicos

# medicineFrecuencyAsNeeded
source: As needed
es: Según necesidad

source: How often do you want to take this medicine?
es: ¿Con qué frecuencia deseas tomar este medicamento?

source: Every
es: Cada

source: Select at least one day
es: Selecciona al menos un día

source: Choose the interval between doses
es: Elige el intervalo entre dosis

source: Select the hours you want to take this medicine
es: Selecciona las horas en las que deseas tomar este medicamento

# everyXdays
source: Every {days} days
es: Cada {days} días

# everyX
source: Every {days}
es: Cada {days}

source: As needed
es: Según necesidad

source: Add hour
es: Agregar hora

source: Start date
es: Fecha de inicio

# medicineName
source: Enter the medicine name
es: Ingresa el nombre del medicamento

# medicineDescription
source: e.g. Ibuprofen
es: Ej: Ibuprofeno

# dosisDescription
source: As it appears on the medicine prospect
es: Como aparece en el prospecto del medicamento

source: Stock warning
es: Advertencia de stock

# stockWarningDescription
source: When the stock is below this value, you will receive a notification
es: Cuando el stock esté por debajo de este valor, recibirás una notificación

source: Current stock
es: Stock actual

# currentStockDescription
source: How many units do you have now?
es: ¿Cuántas unidades tienes actualmente?

source: Instructions
es: Instrucciones

# instructionsHint
source: e.g. Take with food
es: por ejemplo, Tomar con alimentos

# medicineAdded
source: Medicine added successfully
es: Medicamento agregado exitosamente

source: All
es: Todas

source: Not Read
es: No leídos

source: Read
es: Leídos

# emptyNotifications
source: You don't have any notifications yet
es: No tienes notificaciones

# emptyFilteredNotifications
source: You don't have any notifications with this filter
es: No tienes notificaciones con este filtro

# greetingMorning
source: Good morning
es: Buenos días

# greetingAfternoon
source: Good afternoon
es: Buenas tardes

# greetingEvening
source: Good evening
es: Buenas noches

source: Welcome
es: Bienvenido/a

source: Home
es: Inicio

source: Browse
es: Explorar

source: Settings
es: Ajustes

source: Profile
es: Perfil

source: Add
es: Agregar

source: Measurements
es: Mediciones

# measurementsDescription
source: Register your blood pressure, blood glucose, weight, and more
es: Registra tu presión arterial, glucosa en sangre, peso y más

source: Medicines
es: Medicamentos

# medicinesDescriptions
source: Register your medicines and receive reminders
es: Registra tus medicamentos y recibe recordatorios

source: Appointments
es: Turnos médicos

# appointmentDescription
source: Register your appointments and receive reminders
es: Registra tus citas y recibe recordatorios

# orientativeConsultations
source: Orientative consultation
es: Consulta orientativa

source: Linked accounts
es: Cuentas vinculadas

# linkedAccountsDescription
source: Follow someone else's treatment and receive notifications
es: Sigue el tratamiento de alguien más y recibe notificaciones

source: Consumed at
es: Consumido a las

source: Mark as consumed
es: Marcar como consumido

source: Supervisors
es: Supervisores

source: Supervised
es: Supervisados

# supervisedConfrimation
source: Are you sure you want to stop supervising {name}?
es: ¿Estás seguro/a de que deseas dejar de supervisar a {name}?

# supervisorConfrimation
source: Are you sure you want to stop being supervised by {name}?
es: ¿Estás seguro/a de que deseas dejar de ser supervisor de {name}?

# supervisedEmptyMessage
source: You are not supervising anyone yet
es: No estas supervisando a nadie aún

# supervisorEmptyMessage
source: You don't have any supervisor yet
es: No tienes ningún supervisor aún

source: Add supervisor
es: Agregar supervisor

# supervisorDescription
source: A person who will be checking on you and receiving notifications about your treatment
es: Una persona que supervisará tu tratamiento y recibirá notificaciones sobre el estado de tus medicamentos, turnos médicos y mediciones

# supervisedDescription
source: A person you will be checking on and receiving notifications about their treatment
es: Una persona a la que le supervisaras su tratamiento y recibirás notificaciones sobre el estado de sus medicamentos, turnos médicos y mediciones

source: Select a supervised
es: Selecciona un supervisado

# supervisorCodeDescription
source: Share this code with the person you want to supervise. They will be able to enter it in the "Supervisor" section of their app, by pression the floating button with the plus sign.
es: Comparte este código con la persona que deseas supervisar. Podrá ingresarlo en la sección de "Supervisor" de su aplicación, presionando el botón flotante con el signo de suma.
